---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.IsValid
zh: 系统
source: html/700f2642-f813-1955-d3c3-8bb99ac1b125.htm
---
# Autodesk.Revit.DB.MEPSystem.IsValid Property

**中文**: 系统

Indicates if the system is valid or not.
 atom AtomValidateSystem
 default false

## Syntax (C#)
```csharp
public bool IsValid { get; }
```